# 可变不可变类型，进行区分

"""
整形、浮点型、字符串、列表、字典、布尔
"""

# 可变类型：值改变、id不变，证明改的是原汁，证明原值是可以被改变的
# 不可变类型：值改变，id不变，证明是产生的是新的值，压根没有改变原值，证明原值是不可以被修改的


# 2. 验证
# 2.1 int是不可变类型
x=10
print(id(x))

x=11  # 产生新增
print(id(x))


# 2.2 float是不可变类型
y=10.5
print(id(y))

y=11.5  # 产生新增
print(id(y))


# 2.3 str是不可变类型
z="123asd"
print(id(z))

z="456qwe"  # 产生新增
print(id(z))


# 2.4 list是可变类型
l = ["111","222","333"]
print(id(l))
l[0] = "aaaaaaa"
print(l)
print(id(l))


# 2.5 dict是可变类型
di = {"k1":111,"k2":222}
print(id(di))
di['k1'] = 333333333
print(di)
print(id(di))


# 2.6 bool类型
# 不可变

""" 
关于字典补充：
定义：{}内用逗号分隔开，key：value
    其中 value 可以是任意类型
    但是 key 必须是不可变类型

"""
di1={
    'k1':1111,
    123:2.11,
    123.1:'saas123阿萨德~！@#￥',
    'k4':[123,456.789,[123],"123",{"k1":123}],
    'k5':{'1':123}
}


print(di1[123.1])